src/cf/Documents/ЗаявкаНаОткрытиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОткрытиеСчета</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭПКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеВ1СДиректБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛицаПодробно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяИнтеграцияССервисомАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Банки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПродукта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиДополнительнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДопИнформации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФайл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Валюты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаявкаНаОткрытиеСчета/Forms/ПодробноОТарифах/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БанкиАдресХранилища	= Параметры.БанкиАдресХранилища;
	НомерГруппы			= Параметры.НомерГруппы;
	
	СведенияОБанках = ПолучитьИзВременногоХранилища(БанкиАдресХранилища);
	
	СведенияОБанке = СведенияОБанках.Найти(НомерГруппы, "НомерГруппы");
	Если СведенияОБанке = Неопределено Тогда
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Банк = СведенияОБанке.Банк;
	
	Заголовок = Заголовок + Банк;
	
	НомерПродукта = 0;
	
	СтруктураПоиска = Новый Структура("Банк,БанкДоступен", Банк, Истина);
	
	СтрокиСведений = СведенияОБанках.НайтиСтроки(СтруктураПоиска);

	СсылкаВсеТарифы = СтрокиСведений[0].СсылкаНаТаблицуТарифа;
	Элементы.СсылкаТарифныеДокументы1.Видимость = ЗначениеЗаполнено(СсылкаВсеТарифы);
	
	ВсеСсылкиНаТарифыОдинаковы = Истина;
	Для каждого СтрокаСведений Из СтрокиСведений Цикл
		
		ВсеСсылкиНаТарифыОдинаковы = ВсеСсылкиНаТарифыОдинаковы 
			И СсылкаВсеТарифы = СтрокаСведений.СсылкаНаТаблицуТарифа;
		
		НомерПродукта = НомерПродукта + 1;
		
		СуффиксГруппы = Формат(НомерПродукта, "ЧГ=");
		
		ИндексСведений = СведенияОБанках.Индекс(СтрокаСведений);
		
		СписокПродуктов.Добавить(
			Новый Структура("ИдентификаторПродукта, ИндексСведений, ТарифныеДокументы", 
				СтрокаСведений.ИдентификаторПродукта, ИндексСведений, СтрокаСведений.СсылкаНаТаблицуТарифа));

		Если НомерПродукта > 1 Тогда
			
			ЭлементГруппаТарифы = Элементы["ГруппаТарифы"];
			
			// Группа для описания тарифа банка
			ГруппаСтрока = Элементы.Добавить("ГруппаОписаниеТарифа" + СуффиксГруппы, Тип("ГруппаФормы"), ЭлементГруппаТарифы);
			ГруппаСтрока.Вид                              = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтрока.ОтображатьЗаголовок              = Ложь;
			ГруппаСтрока.Отображение                      = ОтображениеОбычнойГруппы.Нет;
			ГруппаСтрока.Группировка                      = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
			ГруппаСтрока.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
			ГруппаСтрока.РастягиватьПоГоризонтали = Истина;
			
			// Группа первой колонки описания.
			ГруппаЛеваяКолонка = Элементы.Добавить("ГруппаЛеваяКолонка" + СуффиксГруппы, Тип("ГруппаФормы"), ГруппаСтрока);
			ГруппаЛеваяКолонка.Вид                              = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЛеваяКолонка.ОтображатьЗаголовок              = Ложь;
			ГруппаЛеваяКолонка.Отображение                      = ОтображениеОбычнойГруппы.Нет;
			ГруппаЛеваяКолонка.Группировка                      = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаЛеваяКолонка.Ширина                           = Элементы.ГруппаЛеваяКолонка1.Ширина;
			
			// Декорация для наименования продукта.
			НаименованиеПродукта = Элементы.Добавить("НаименованиеПродукта" + СуффиксГруппы, Тип("ДекорацияФормы"), ГруппаЛеваяКолонка);
			НаименованиеПродукта.Вид        = ВидДекорацииФормы.Надпись;
			НаименованиеПродукта.ЦветТекста = ЦветаСтиля.ЦветАкцента;
			
			// Декорация для подробного описания.
			ПодробноеОписание = Элементы.Добавить("ПодробноеОписание" + СуффиксГруппы, Тип("ДекорацияФормы"), ГруппаЛеваяКолонка);
			ПодробноеОписание.Вид = ВидДекорацииФормы.Надпись;
			ПодробноеОписание.АвтоМаксимальнаяШирина = Ложь;
			
			// Разделитель - линия.
			СсылкаДокументы = Элементы.Добавить("СсылкаТарифныеДокументы" + СуффиксГруппы, Тип("ДекорацияФормы"), ЭлементГруппаТарифы);
			СсылкаДокументы.Вид 		= ВидДекорацииФормы.Надпись;
			СсылкаДокументы.Гиперссылка = Истина;
			СсылкаДокументы.Заголовок	= "Тарифные документы";
			СсылкаДокументы.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			СсылкаДокументы.УстановитьДействие("Нажатие", "СсылкаТарифныеДокументыНажатие"); 
			СсылкаДокументы.Видимость = ЗначениеЗаполнено(СтрокаСведений.СсылкаНаТаблицуТарифа);

			// Разделитель - линия.
			Разделитель = Элементы.Добавить("ДекорацияРазделитель" + СуффиксГруппы, Тип("ДекорацияФормы"), ЭлементГруппаТарифы);
			Разделитель.Вид                      = ВидДекорацииФормы.Картинка;
			Разделитель.Картинка                 = БиблиотекаКартинок.ГоризонтальныйРазделитель;
			Разделитель.РазмерКартинки           = РазмерКартинки.Черепица;
			Разделитель.АвтоМаксимальнаяШирина   = Ложь;
			Разделитель.РастягиватьПоГоризонтали = Истина;
			
			ИмяКоманды = "КомандаВыбрать" + СуффиксГруппы;
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие	= "КомандаВыбрать";
			НоваяКоманда.Заголовок	= "Выбрать";
			
			КнопкаВыбрать = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаСтрока);
			КнопкаВыбрать.ИмяКоманды = ИмяКоманды;
			КнопкаВыбрать.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право
			
		КонецЕсли;
		
		ПодробноеОписание = Элементы["ПодробноеОписание" + СуффиксГруппы];
		ПодробноеОписание.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрокаСведений.ПодробноеОписание);
		
		НаименованиеПродукта = Элементы["НаименованиеПродукта" + СуффиксГруппы];
		НаименованиеПродукта.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрокаСведений.НаименованиеПродукта);

	КонецЦикла;
	
	Если ВсеСсылкиНаТарифыОдинаковы И ЗначениеЗаполнено(СсылкаВсеТарифы) Тогда
		
		ИндексПродукта = 0;
		Для каждого ПродуктБанка Из СписокПродуктов Цикл
			ИндексПродукта = ИндексПродукта + 1;
			Элементы["СсылкаТарифныеДокументы" + ИндексПродукта].Видимость = Ложь;
		КонецЦикла;
		
		Элементы.ФормаОткрытьВсеТарифы.Видимость = Истина;
	Иначе
		Элементы.ФормаОткрытьВсеТарифы.Видимость = Ложь;
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
	Если ЭтотОбъект.Высота > 40 Тогда
		
		ЭтотОбъект.Высота = 40;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	НомерПункта = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(Команда.Имя));
	
	СтруктураВозврата = Новый Структура("Банк,ИдентификаторПродукта,НомерГруппы,ИндексСведений");
	СтруктураВозврата.Банк = Банк;
	СтруктураВозврата.НомерГруппы = НомерГруппы;
	
	ИнформацияДляРезультата = СписокПродуктов[НомерПункта - 1].Значение;
	
	СтруктураВозврата.ИдентификаторПродукта = ИнформацияДляРезультата.ИдентификаторПродукта;
	СтруктураВозврата.ИндексСведений = ИнформацияДляРезультата.ИндексСведений;
	
	Закрыть(СтруктураВозврата);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьТарифныеДокументы(Команда)
	
	ПерейтиПоНавигационнойСсылке(СсылкаВсеТарифы);

КонецПроцедуры

&НаКлиенте
Процедура СсылкаТарифныеДокументыНажатие(Элемент)
	
	НомерПункта = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбщегоНазначенияБПКлиентСервер.ОставитьВСтрокеТолькоЦифры(Элемент.Имя));
	ИнформацияОПункте = СписокПродуктов[НомерПункта - 1].Значение;
	
	Если ЗначениеЗаполнено(ИнформацияОПункте.ТарифныеДокументы) Тогда
		ПерейтиПоНавигационнойСсылке(ИнформацияОПункте.ТарифныеДокументы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
